УТ_для_edt/src/InformationRegisters/смартIECHOВопросыОтветыПоКомплектующим/смартIECHOВопросыОтветыПоКомплектующим.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартIECHOВопросыОтветыПоКомплектующим</name>
  <comment>//смарт:ММ 621 21.09.2021</comment>
  <dimensions>
    <name>ИсходнаяКомплектующая</name>
    <type>
      <types>CatalogRef.смартIECHOКомплектующие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.смартIECHOВопросы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответ</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комплектующая</name>
    <type>
      <types>CatalogRef.смартIECHOКомплектующие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартIECHOВопросыОтветыПоКомплектующим/Forms/ФормаСписка/Module.bsl
//++ смарт:ММ 621 30.09.2021 
&НаКлиенте
Процедура СкопироватьДругим(Команда)
	
	ОписаниеОпопвещенияОЗакрытии = Новый ОписаниеОповещения("смартПослеЗакрытияСкопироватьДругим", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.смартIECHOВопросыОтветыПоКомплектующим.Форма.ПодобранныеКомплектующие", , ЭтаФорма,,,, ОписаниеОпопвещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //-- смарт:ММ 30.09.2021

//++ смарт:ММ 621 30.09.2021 
&НаКлиенте
Процедура смартПослеЗакрытияСкопироватьДругим(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Массив") Тогда
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			смартСкопироватьДругимСервер(РезультатЗакрытия, ТекущиеДанные.ИсходнаяКомплектующая);
			Оповестить("смартИзмененРегистрсмартIECHOВопросыОтветыПоКомплектующим");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 30.09.2021

//++ смарт:ММ 621 30.09.2021  
&НаСервере
Процедура смартСкопироватьДругимСервер(МассивКомплектующих, ИсходнаяКомплектующая)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартIECHOВопросыОтветыПоКомплектующим.Вопрос,
	|	смартIECHOВопросыОтветыПоКомплектующим.Ответ,
	|	смартIECHOВопросыОтветыПоКомплектующим.Комплектующая
	|ИЗ
	|	РегистрСведений.смартIECHOВопросыОтветыПоКомплектующим КАК смартIECHOВопросыОтветыПоКомплектующим
	|ГДЕ 
	|   смартIECHOВопросыОтветыПоКомплектующим.ИсходнаяКомплектующая = &ИсходнаяКомплектующая
	|";
	
	Запрос.УстановитьПараметр("ИсходнаяКомплектующая", ИсходнаяКомплектующая);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого ЭлементМассива Из МассивКомплектующих Цикл
			
			МенеджерЗаписи = РегистрыСведений.смартIECHOВопросыОтветыПоКомплектующим.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.ИсходнаяКомплектующая = ЭлементМассива;
						
			МенеджерЗаписи.Записать();
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 30.09.2021

//++ смарт:ММ 621 30.09.2021 
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "смартИзмененРегистрсмартIECHOВопросыОтветыПоКомплектующим" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 30.09.2021
